eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_tim.h
/**
  ******************************************************************************
  * @file    MDR32F9Qx_timer.h
  * @author  Phyton Application Team
  * @version V1.4.0
  * @date    16/02/2011
  * @brief   This file contains all the functions prototypes for the TIMER
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 Phyton</center></h2>
  ******************************************************************************
  * FILE MDR32F9Qx_timer.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F9QX_TIMER_H
#define __MDR32F9QX_TIMER_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stdint.h"	
#include "mdr32f8_config.h"
#include "MDR1986VE8T.h"	

/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @addtogroup TIMER
  * @{
  */

/** @defgroup TIMER_Exported_Types TIMER Exported Types
  * @{
  */

/**
  * @brief  TIMER Counter Init structure definition
  */

typedef struct {

#if defined(USE_MDR1986VE9x) /* For Cortex M3 */
	uint16_t TIMER_IniCounter; 		 /*!< Specifies the initial counter value.
	 	 	 	 	 	 	 	     	  This parameter can be a number between 0x0000 and 0xFFFF. */
#elif ((defined (USE_MDR1986VE3)) || (defined (USE_MDR1986VE1T)))
	uint32_t TIMER_IniCounter;		/*!< Specifies the initial counter value.
									 	 This parameter can be a number between 0x0000 and 0xFFFFFFFF. */
#endif // #elif ((defined (USE_MDR1986VE3)) || (defined (USE_MDR1986VE1T)))

	uint16_t TIMER_Prescaler; 		 /*!< Specifies the prescaler value used to divide the TIMER clock.
	 	 	 	 	 	 	 	   	 	  This parameter can be a number between 0x0000 and 0xFFFF.
	 	 	 	 	 	 	 	   	 	  CLK = TIMER_CLK/(TIMER_Prescaler + 1) */

#if defined(USE_MDR1986VE9x) 		 /* For Cortex M3 */
	uint16_t TIMER_Period; 			 /*!< Specifies the period value to be loaded into the
	 	 	 	 	 	 	 	 	 	  Auto-Reload Register (ARR) at the next update event.
	 	 	 	 	 	 	 	 	 	  This parameter must be a number between 0x0000 and 0xFFFF.  */
#elif ((defined (USE_MDR1986VE3)) || (defined (USE_MDR1986VE1T))) /* For Cortex M1 */
	uint32_t TIMER_Period;			/*!< Specifies the period value to be loaded into the
										 Auto-Reload Register (ARR) at the next update event.
										 This parameter must be a number between 0x0000 and 0xFFFFFFFF.  */
#endif // #elif ((defined (USE_MDR1986VE3)) || (defined (USE_MDR1986VE1T))) /* For Cortex M1 */

	uint16_t TIMER_CounterMode;		 /*!< Specifies the counter mode.
	 	 	 	 	 	 	 	 	 	  This parameter can be a value of @ref TIMER_Counter_Mode */

	uint16_t TIMER_CounterDirection; /*!< Specifies the counter direction.
	 	 	 	 	 	 	 	 	 	  This parameter can be a value of @ref TIMER_Counter_Direction */

	uint16_t TIMER_EventSource; 	/*!< Specifies the Counter Event source.
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_Event_Source */

	uint16_t TIMER_FilterSampling;  /*!< Specifies the filter sampling clock (FDTS).
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_Filter_Sampling */

	uint16_t TIMER_ARR_UpdateMode; 	/*!< Specifies the Auto-Reload Register (ARR) updating mode.
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_ARR_Update_Mode */

	uint16_t TIMER_ETR_FilterConf; 	/*!< Specifies the ETR Filter configuration.
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_FilterConfiguration */

	uint16_t TIMER_ETR_Prescaler; 	/*!< Specifies the ETR Prescaler configuration.
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_ETR_Prescaler */

	uint16_t TIMER_ETR_Polarity; 	/*!< Specifies the ETR Polarity configuration.
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_ETR_Polarity */

	uint16_t TIMER_BRK_Polarity; 	/*!< Specifies the BRK Polarity configuration.
	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref TIMER_BRK_Polarity */
} TIMER_CntInitTypeDef;

/**
  * @brief  TIMER Channel Init structure definition
  */

typedef struct
{
  uint16_t TIMER_CH_Number;             /*!< Specifies the TIMER Channel number to be configured.
                                             This parameter can be a value of @ref TIMER_CH_Number */

  uint16_t TIMER_CH_Mode;               /*!< Specifies the TIMER Channel mode.
                                             This parameter can be a value of @ref TIMER_CH_Mode */

  uint16_t TIMER_CH_ETR_Ena;            /*!< Enables or disables ETR.
                                             This parameter can be a value of FunctionalState */

  uint16_t TIMER_CH_ETR_Reset;          /*!< Enables or disables ETR Reset.
                                             This parameter can be a value of @ref TIMER_CH_ETR_Reset */

  uint16_t TIMER_CH_BRK_Reset;          /*!< Enables or disables BRK Reset.
                                             This parameter can be a value of @ref TIMER_CH_BRK_Reset */

  uint16_t TIMER_CH_REF_Format;         /*!< Specifies the REF signal format.
                                             This parameter can be a value of @ref TIMER_CH_REF_Format */

  uint16_t TIMER_CH_Prescaler;          /*!< Specifies the TIMER Channel Prescaler configuration.
                                             This parameter can be a value of @ref TIMER_CH_Prescaler */

  uint16_t TIMER_CH_EventSource;        /*!< Specifies the Channel Event source.
                                             This parameter can be a value of @ref TIMER_CH_EventSource */

  uint16_t TIMER_CH_FilterConf;         /*!< Specifies the TIMER Channel Filter configuration.
                                             This parameter can be a value of @ref TIMER_FilterConfiguration */

  uint16_t TIMER_CH_CCR_UpdateMode;     /*!< Specifies the TIMER CCR, CCR1 update mode.
                                             This parameter can be a value of @ref TIMER_CH_CCR_Update_Mode */

  uint16_t TIMER_CH_CCR1_Ena;           /*!< Enables or disables the CCR1 register.
                                             This parameter can be a value of FunctionalState */

  uint16_t TIMER_CH_CCR1_EventSource;   /*!< Specifies the Channel CCR1 Event source.
                                             This parameter can be a value of @ref TIMER_CH_CCR1_EventSource */
}TIMER_ChnInitTypeDef;

/**
  * @brief  TIMER Channel Output Init structure definition
  */

typedef struct
{
  uint16_t TIMER_CH_Number;             /*!< Specifies the TIMER Channel number to be configured.
                                             This parameter can be a value of @ref TIMER_CH_Number */

  uint16_t TIMER_CH_DirOut_Polarity;    /*!< Specifies the TIMER CHx output polarity.
                                             This parameter can be a value of @ref TIMER_CH_OUT_Polarity */

  uint16_t TIMER_CH_DirOut_Source;      /*!< Specifies the TIMER CHx output source.
                                             This parameter can be a value of @ref TIMER_CH_OUT_Source */

